# 计算机网络笔记

#### @author:LittleXi

## [学习链接](https://www.bilibili.com/video/BV19E411D78Q?p=1)

## 1  三大模型

#### 1.1 OSI参考模型

```
应用层							应用层
表示层							表示层
会话层							会话层
传输层							传输层
网络层							网络层
数据链路层					   数据链路层
物理层		---------------->	物理层
```

#### 1.2 TCP/IP参考模型      TCP/IP协议栈

```
应用层					HTTP|FTP|DNS
传输层					TCP  	UDP	
网际层					IP	
网络接口层			   Ethernet ATM Frame Relay	
```

#### 1.3 5层参考模型

```
应用层						应用层
传输层  					传输层
网络层						网络层
数据链路层				   数据链路层
物理层 	------------->	物理层
```

## 2  物理层

#### 2.1 通信基础

		##### 2.1.1三大特性

```
1、机械特性：物理特性，比如引脚数目、接口性状等
2、电气特性：传输二进制位是，线路上的电压范围、阻抗匹配、传输速率、距离限制等
3、功能特性：电平意义、接口部件的信号线用途
```

##### 2.1.2  数据通信

##### *典型的数据通信模型

```
电脑————————>调制解调器————————>公用电话网————————>调制解调器————————>电脑
	数字信号		   模拟信号			  模拟信号			数字信号
	
*———————————————————————————————————————————————————————————————————————————————————————*	
——————>信源——————>发送器————————>传输系统————————>接收器——————>信宿——————>
输入信息	输入数据	 发送的信号		 接受的信号		输出数据	输出信息

```

*数据通信相关术语

```
数据：传送信息的实体，通常是有意义的符号序列
信号：数据的电气/电磁的表现，是数据在传输过程中的存在形式
	数字信号：代表消息的参数取值是离散的。_|-|_|-|_
	模拟信号：代表消息的参数取值是连续的。~v~v~v~v~
信源：产生和发送数据的源头
信宿：接收数据的终点
信道：信号的传输媒介。一般用来表示向某一个方向传送信息的介质，因此一条通信线路往往包含一条发送信道和一条接收信道
```







